# Data Loading, Storage and File Formats

In [1]:
import numpy as np
import pandas as pd
np.random.seed(12345)

### Reading and Writing Data in Text Format

In [4]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
data.to_csv('examples/out.csv')

### JSON Data

In [13]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [20]:
import json
result = json.loads(obj) # To convert a JSON string to Python form, use json.loads
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [19]:
asjson = json.dumps(result) # json.dumps converts a Python object back to JSON:

In [21]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [22]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### HTML: Web Scraping

In [3]:
!pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\users\hp\anaconda3\lib\site-packages (4.6.3)
Requirement already satisfied: html5lib in c:\users\hp\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: six>=1.9 in c:\users\hp\anaconda3\lib\site-packages (from html5lib) (1.12.0)
Requirement already satisfied: webencodings in c:\users\hp\anaconda3\lib\site-packages (from html5lib) (0.5.1)

In [4]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [6]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [7]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

### Reading Microsoft Excel Files

In [11]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Interacting with Web APIs

Many websites have public APIs providing data feeds via JSON or some other format.
There are a number of ways to access these APIs from Python; one easy-to-use method
that I recommend is the requests package

In [13]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

The Response object’s text attribute contains the content of the GET query. Many web
APIs will return a JSON string that must be loaded into a Python object

In [14]:
data = resp.json()
data[0]['title']

'REF: separate method-pinning functions'

In [15]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,27811,REF: separate method-pinning functions,[],open
1,27810,TST: skip test if running non-installed,[],open
2,27809,CI: remove pytest pins,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
3,27808,VIS: Fix DataFrame.plot() produces incorrect l...,"[{'id': 2413328, 'node_id': 'MDU6TGFiZWwyNDEzM...",open
4,27807,"BUG: fix+test op(NaT, ndarray), also simplify",[],open
5,27805,DataFrame and Series iterators have many incon...,[],open
6,27804,[WIP] Improve CI/CD pipeline performance,[],open
7,27803,REF: Simplify _comp_method_SERIES,[],open
8,27802,DOC: Series.str.slice() should show that negat...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
9,27801,"[ENH] Add argmax, max, argmin, min to EA",[],open
10,27800,BUG: aggregation on ordered categorical column...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
11,27799,BUG: pivot_table fails with aggfunc='size' and...,[],open
12,27798,DOC: add print statement in to_latex example,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
13,27796,Missing spaces between lines and y-axis,[],open
14,27794,Min/max does not work for dates with timezones...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
15,27791,CLN: Assorted Cleanups,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
16,27790,BUG: Increase range of dates for holiday calcu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
17,27789,DOC: add print statement in to_latex example,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
18,27784,ENH: allow object-dtype Index to do arithmetic...,"[{'id': 57296398, 'node_id': 'MDU6TGFiZWw1NzI5...",open
19,27781,Filtering dataframe with sparse column leads t...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,27780,DOC: Add CoC to the README,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
21,27779,Give more precise warning when passing `header...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
22,27778,ENH: allow new column names argument in DataFr...,"[{'id': 219960758, 'node_id': 'MDU6TGFiZWwyMTk...",open
23,27777,Avoid calling S3File.s3,"[{'id': 2301354, 'node_id': 'MDU6TGFiZWwyMzAxM...",open
24,27776,Multilevel Column Index Assignment Doesn't Work,[],open
25,27775,IndexError: tuple index out of range after upg...,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
26,27773,BUG: _can_use_numexpr fails when passed large ...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
27,27772,to_excel with MultiIndex adds a blank line,[],open
28,27771,to_csv has changed the number,[],open
29,27769,REF: Make CategoricalIndex comparison defer to...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open